/**
 * @filename package-info.java
 * @description  
 * @version 1.0
 * @author qye.zheng
 */
/**
 * @type package-info
 * @description  设计模式-结构型 ->访问者模式
 * @author qye.zheng
 */
package com.hua.behavior.visitor;

/**
 * 访问者模式
 * 
 * 1) 访问者模式把数据结构和算法(作用于结构上的操作)解耦，使得算法可以自由
 * 演化，而数据结构则始终保持不变.
 * 访问者模式就是一种分离对象数据结构与行为的方法，通过这种分离，可达到一个
 * 被访问者添加行的操作而无需做其他修改的效果.
 * 2) 
 * 
 * 3)该模式适用场景：
 * 如果我们想为一个现有的类增加新功能，不得不考虑几个事情：
 * 1、新功能会不会与现有功能出现兼容性问题？
 * 2、以后会不会再需要添加？
 * 3、如果类不允许修改代码怎么办？面对这些问题，最好的解决方法就是使用访问者模式，
 * 访问者模式适用于数据结构相对稳定的系统，把数据结构和算法解耦，
 *
 *
 *
 */

